---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Contains(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
source: html/ef507d94-7ebd-39b9-532c-1952ef6201b1.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Contains Method

Tests for the existence of a MEPBuildingConstruction within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	MEPBuildingConstruction item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction`) - The MEPBuildingConstruction to be searched for.

## Returns
The Contains method returns True if the MEPBuildingConstruction is within the set, otherwise False.